tutorials/multicomponentFluid/lockExchange/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    sludge  0;
    water   1;
}

zones
{
    sludge
    {
        type        box;
        zoneType    cell;

        box         (0 0 0) (5 2 2);

        values
        {
            sludge  1;
            water   0;
        }
    }
}

// ************************************************************************* //
